; domain
(define (domain blocksworld)
(:predicates (clear ?x)
             (ontable ?x)
             (on ?x ?y))

(:action move-b-to-b
  :parameters (?bm ?bf ?bt)
  :precondition (and (clear ?bm) (clear ?bt) (on ?bm ?bf))
  :effect (and (not (clear ?bt)) (not (on ?bm ?bf))
               (on ?bm ?bt) (clear ?bf)))

(:action move-b-to-t
  :parameters (?bm ?bf)
  :precondition (and (clear ?bm) (on ?bm ?bf))
  :effect (and (not (on ?bm ?bf))
               (ontable ?bm) (clear ?bf)))

(:action move-t-to-b
  :parameters (?bm ?bt)
  :precondition (and (clear ?bm) (clear ?bt) (ontable ?bm))
  :effect (and (not (clear ?bt)) (not (ontable ?bm))
               (on ?bm ?bt))))

; problem
(define (problem BW-rand-12)
(:domain blocksworld)
(:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 )
(:init
(on b1 b12)
(on b2 b5)
(on b3 b6)
(on b4 b2)
(on b5 b8)
(ontable b6)
(on b7 b11)
(on b8 b9)
(ontable b9)
(on b10 b1)
(on b11 b3)
(on b12 b4)
(clear b7)
(clear b10)
)
(:goal
(and
(on b1 b9)
(on b2 b6)
(on b3 b7)
(on b6 b8)
(on b7 b10)
(on b9 b5)
(on b10 b1)
(on b11 b3))
)
)

; plan
1. (move-b-to-b b10 b1 b7)
   deleted: (clear b7) (on b10 b1)
   added: (on b10 b7) (clear b1)
   goals met: 1 of 8
2. (move-b-to-b b1 b12 b10)
   deleted: (clear b10) (on b1 b12)
   added: (on b1 b10) (clear b12)
   goals met: 1 of 8
3. (move-b-to-t b12 b4)
   deleted: (on b12 b4)
   added: (ontable b12) (clear b4)
   goals met: 1 of 8
4. (move-b-to-t b4 b2)
   deleted: (on b4 b2)
   added: (ontable b4) (clear b2)
   goals met: 1 of 8
5. (move-b-to-t b2 b5)
   deleted: (on b2 b5)
   added: (ontable b2) (clear b5)
   goals met: 1 of 8
6. (move-b-to-b b5 b8 b4)
   deleted: (clear b4) (on b5 b8)
   added: (on b5 b4) (clear b8)
   goals met: 1 of 8
7. (move-b-to-b b8 b9 b12)
   deleted: (clear b12) (on b8 b9)
   added: (on b8 b12) (clear b9)
   goals met: 1 of 8
8. (move-t-to-b b9 b5)
   deleted: (clear b5) (ontable b9)
   added: (on b9 b5)
   goals met: 2 of 8
9. (move-b-to-b b1 b10 b9)
   deleted: (clear b9) (on b1 b10)
   added: (on b1 b9) (clear b10)
   goals met: 3 of 8
10. (move-b-to-b b10 b7 b1)
   deleted: (clear b1) (on b10 b7)
   added: (on b10 b1) (clear b7)
   goals met: 4 of 8
11. (move-b-to-b b7 b11 b10)
   deleted: (clear b10) (on b7 b11)
   added: (on b7 b10) (clear b11)
   goals met: 5 of 8
12. (move-b-to-b b11 b3 b2)
   deleted: (clear b2) (on b11 b3)
   added: (on b11 b2) (clear b3)
   goals met: 4 of 8
13. (move-b-to-b b3 b6 b7)
   deleted: (clear b7) (on b3 b6)
   added: (on b3 b7) (clear b6)
   goals met: 5 of 8
14. (move-b-to-b b11 b2 b3)
   deleted: (clear b3) (on b11 b2)
   added: (on b11 b3) (clear b2)
   goals met: 6 of 8
15. (move-t-to-b b6 b8)
   deleted: (clear b8) (ontable b6)
   added: (on b6 b8)
   goals met: 7 of 8
16. (move-t-to-b b2 b6)
   deleted: (clear b6) (ontable b2)
   added: (on b2 b6)
   goals met: 8 of 8
